Repository: pepr/progit2-cs
Catalog: omegat/ScottChacon_ProGit2-omegat.tmx
Source language: en
Languages: cs

source: If you just specify the path, Git tries to use hardlinks or directly copy the files it needs.
cs: Pokud uvedete pouze cestu, pokouší se Git použít pevné odkazy (hardlink), nebo přímo kopíruje potřebné soubory.

source: If you know how to run the command line version, you can probably also figure out how to run the GUI version, while the opposite is not necessarily true.
cs: Pokud umíte použít verzi z příkazového řádku, pak pravděpodobně umíte zjistit, jak se totéž provede přes grafické uživatelské rozhraní. V opačném směru to nemusí platit.

source: If you look at the last commit, you can see the new `git-svn-id` that was added:
cs: Pokud se podíváte na poslední revizi, uvidíte nově přidané `git-svn-id`:

source: If you look at the resulting tree, you can see the SHA-1 value your repo.rb file got for the blob object:
cs: Pokud se podíváte na výsledný strom, uvidíte hodnotu SHA-1, kterou soubor repo.rb dostal pro objekt blobu:

source: If you make some changes and commit again, the next commit stores a pointer to the commit that came immediately before it.
cs: Jestliže v souborech provedete změny a zapíšete je, další objekt revize uloží ukazatel na bezprostředně přecházející objekt revize.

source: If you modified the file and added it to the index already, you must force the removal with the `-f` option.
cs: Pokud už jste soubor upravili a už jste ho přidali do indexu, musíte odstranění vynutit přidáním volby `-f` footnote:[Pozn. překl.: *f* jako _force_, čili _vynucení silou_.].

source: If you modify a file after you run `git add`, you have to run `git add` again to stage the latest version of the file:
cs: Pokud upravíte soubor po provedení příkazu `git add`, je třeba spustit `git add` ještě jednou, aby byla k zápisu připravena aktuální verze souboru:

source: If you name your trunk, branches, or tags differently, you can change these options.
cs: Pokud pojmenujete svůj kmenový adresář (trunk), větve nebo značky jinak, lze tyto parametry změnit.

source: If you need to pull it in, you can merge your `master` branch into your `iss53` branch by running `git merge master`, or you can wait to integrate those changes until you decide to pull the `iss53` branch back into `master` later.
cs: Pokud potřebujete tyto změny do větve vtáhnout, můžete začlenit větev `master` do větve `iss53` provedením příkazu `git merge master`, nebo můžete s integrací změn vyčkat a provést ji až ve chvíli, kdy budete chtít větev `iss53` vtáhnout zpět do větve `master`.

source: If you only want to modify your last commit message, it’s very simple:
cs: Chcete-li pouze změnit zprávu k poslední revizi, je to velmi jednoduché:

source: If you or a partner does find it necessary at some point, make sure everyone knows to run `git pull --rebase` to try to make the pain after it happens a little bit simpler.
cs: Pokud to vy nebo váš partner v určité chvíli považujete za nezbytnost, ujistěte se, že všichni umí spustit `git pull --rebase`, aby poté své utrpení učinili o něco snesitelnějším.

source: If you pass `--abbrev-commit` to the `git log` command, the output will use shorter values but keep them unique; it defaults to using seven characters but makes them longer if necessary to keep the SHA-1 unambiguous:
cs: Zadáte-li k příkazu `git log` parametr `--abbrev-commit`, výstup bude používat kratší hodnoty, ale pouze v jednoznačném tvaru. Standardně se používá sedm znaků, avšak je-li to kvůli jednoznačnosti hodnoty SHA-1 nezbytné, bude použito znaků více:

source: If you pass `-C` to `git blame`, Git analyzes the file you’re annotating and tries to figure out where snippets of code within it originally came from if they were copied from elsewhere.
cs: Zadáte-li k příkazu `git blame` parametr `-C`, Git zanalyzuje soubor, který anotujete, a pokud jednotlivé kousky kódu v něm obsažené pocházejí původně odjinud, pokusí se Git zjistit odkud.

source: If you pass the option `--system` to `git config`, it reads and writes from this file specifically.
cs: Zadáte-li příkazu `git config` parametr `--system`, pak Git čte a zapisuje konkrétně do tohoto souboru.

source: If you place a `^` at the end of a reference, Git resolves it to mean the parent of that commit.
cs: Umístíte-li na konec reference znak `^`, Git bude referenci chápat tak, že označuje rodiče dané revize.

source: If you place your data on a hosted server, it's easy to set up and maintain; however, you have to be able to keep your code on someone else's servers, and some organizations don't allow that.
cs: Umístíte-li data na hostovaný server, bude nastavení a správa jednoduchá. Svůj zdrojový kód však v takovém případě ukládáte na cizím serveru, což některé organizace nedovolují.

source: If you press Enter after typing nothing at the `Update>>` prompt, Git takes anything selected and stages it for you:
cs: Jestliže na výzvu `Update>>` nic nezadáte a stisknete klávesu Enter, Git vezme všechny vybrané soubory a připraví je k zapsání:

source: If you pull down work that was rewritten and rebase it on top of the new commits from your partner, Git can often successfully figure out what is uniquely yours and apply them back on top of the new branch.
cs: Pokud si stáhnete práci, která byla přepsána a nad těmito novými objekty revize od spolupracovníka provedete přeskládání, umí často Git úspěšně zjistit, co pochází určitě od vás a aplikovat to na vrchol nové větve.

source: If you push commits somewhere and others pull them down and base work on them, and then you rewrite those commits with `git rebase` and push them up again, your collaborators will have to re-merge their work and things will get messy when you try to pull their work back into yours.
cs: Pokud objekty revize odešlete (push) a ostatní si je stáhnou (pull) a založí na nich svou práci a vy potom tyto revize přepíšete příkazem `git rebase` a znovu je odešlete, vaši spolupracovníci budou muset znovu znovu začleňovat svou práci (merge) a ve věcech zavládne chaos v okamžiku, kdy se pokusíte vtáhnout jejich práci zpět do své.

source: If you really do want to delete the branch and lose that work, you can force it with `-D`, as the helpful message points out.
cs: Pokud opravdu chcete větev odstranit a zahodit práci, kterou obsahuje, můžete to vynutit parametrem `-D` -- jak napovídá užitečná zpráva pod chybovým hlášením.

source: If you rebase commits that have already been pushed publicly, and people may have based work on those commits, then you may be in for some frustrating trouble, and the scorn of your teammates.
cs: Pokud přeskládáte revize, které již byly odeslány do veřejného prostoru a ostatní na těchto revizích (commit) mohli založit další práce, pak se můžete dostat do nepříjemných potíží a stát se předmětem opovržení týmových kolegů.

source: If you rename a file in Git, no metadata is stored in Git that tells it you renamed the file.
cs: Pokud soubor v systému Git přejmenujete, neuloží se žádná metadata s informací, že jste soubor přejmenovali.

source: If you replace an image in your project and run `git diff`, you see something like this:
cs: Pokud nahradíte některý z obrázků ve svém projektu a spustíte příkaz `git diff`, zobrazí se asi toto:

source: If you run `git add` with the `-i` or `--interactive` option, Git goes into an interactive shell mode, displaying something like this:
cs: Spustíte-li příkaz `git add` s parametrem `-i` nebo `--interactive`, přejde Git do interaktivního režimu shellu a zobrazí zhruba následující:

source: If you run `git checkout test`, Git updates the file to look like this:
cs: Spustíte-li příkaz `git checkout test`, Git aktualizuje soubor do následující podoby:

source: If you run `git clone -o booyah` instead, then you will have `booyah/master` as your default remote branch.(((origin))) ====
cs: Pokud místo toho spustíte `git clone -o booyah`, dostanete jako výchozí vzdálenou větev `booyah/master`.(((origin))) ====

source: If you run `git diff` normally, you only see something like this:
cs: Spustíte-li příkaz `git diff` normálně, zobrazí se zhruba toto:

source: If you run `git diff` on that, you see something interesting:
cs: Pokud na ni použijete příkaz `git diff`, uvidíte zajímavou věc:

source: If you run `git difftool` instead of `git diff`, you can view any of these diffs in software like emerge, vimdiff and many more (including commercial products).
cs: Pokud místo příkazu `git diff` spustíte `git difftool`, můžete si výslednou podobu rozdílů prohlížet v programech jako jsou emerge, vimdiff a další (včetně komerčních produktů).

source: If you run `git gc`, all the objects are in a packfile; you can identify the big objects by running another plumbing command called `git verify-pack` and sorting on the third field in the output, which is file size.
cs: Spustíte-li příkaz `git gc`, všechny objekty jsou v balíčkovém souboru. Velké objekty lze identifikovat spuštěním jiného nízkoúrovňového příkazu, `git verify-pack`, a seřazením podle třetího pole ve výpisu, v němž je uvedena velikost souboru.

source: If you run `git log --oneline --decorate --graph --all` it will print out the history of your commits, showing where your branch pointers are and how your history has diverged.
cs: Když spustíte `git log --oneline --decorate --graph --all`, zobrazí se historie revizí, která ukazuje polohu ukazatelů na větve a jak se historie rozdělila.

source: If you run `git log`, you can see that all the SHA-1 checksums for the commits have changed, but the `git-p4` strings are no longer in the commit messages:
cs: Spustíte-li příkaz `git log`, uvidíte, že se změnily všechny kontrolní součty revizí SHA-1, zato všechny řetězce `git-p4` ze zpráv k revizím zmizely:

source: If you run `git push --tags`, the `maintainer-pgp-pub` tag will be shared with everyone.
cs: Zadáte-li příkaz `git push --tags`, začnete značku `maintainer-pgp-pub` sdílet s ostatními.

source: If you run `git show` on that tag, you can see your GPG signature attached to it:
cs: Pokud pro tuto značku spustíte příkaz `git show`, uvidíte k ní připojen svůj podpis GPG:

source: If you run `git status -s` or `git status --short` you get a far more simplified output from the command:
cs: Pokud spustíte `git status -s` nebo `git status --short` bude výstup příkazu mnohem jednodušší:

source: If you run `git status`, you can see your dirty state:
cs: Spustíte-li příkaz `git status`, uvidíte neuspořádaný stav svého projektu:

source: If you run a `git log` when your history looks like this, you'll see two commits that have the same author, date, and message, which will be confusing.
cs: Pokud s takovouto historií spustíte příkaz `git log`, nastane zmatečná situace, kdy se zobrazí dvě revize se stejným autorem, datem a zprávou k revizi.

source: If you run a `git push` and your current branch is tracking `origin/master`, the commits listed by `git log origin/master..HEAD` are the commits that will be transferred to the server.
cs: Spustíte-li příkaz `git push` a vaše aktuální větev sleduje větev `origin/master`, budou na server přesunuty revize, které lze zobrazit příkazem `git log origin/master..HEAD`.

source: If you run a `log`, you see something like this:
cs: Po spuštění příkazu `log` by se zobrazilo následující:

source: If you run that command before committing, you can tell if you're about to commit whitespace issues that may annoy other developers.
cs: Spustíte-li tento příkaz před zapsáním revize, můžete zjistit, zda se budou zapisovat i problematické prázdné znaky, které by mohly ostatní vývojáře obtěžovat.

source: If you run this instead of setting up the `extMerge` and `extDiff` files, Git will use KDiff3 for merge resolution and the normal Git diff tool for diffs.
cs: Pokud spustíte tento příkaz místo nastavení souborů `extMerge` a `extDiff`, Git bude používat KDiff3 k řešení konfliktů při slučování a interní nástroj diff systému Git pro výpisy nástroje diff.

source: If you run your `git status` command, you once again see something like this:
cs: Pokud provedete příkas `git status`, uvidíte opět něco takového:

source: If you run your status command again, you can see that your README file is now tracked and staged to be committed:
cs: Když znovu provedete příkaz `git status`, uvidíte, že je nyní soubor `README` sledován a připraven k zapsání:

source: If you set this attribute on a file or set of files, then the next time you check out that branch, Git will replace that field with the SHA-1 of the blob.
cs: Pokud tento atribut nastavíte pro soubor nebo sadu souborů, při příštím checkoutu této větve Git nahradí toto pole kontrolním součtem SHA-1 blobu.

source: If you simply remove the file from your working directory, it shows up under the ``Changed but not updated'' (that is, _unstaged_) area of your `git status` output:
cs: Pokud soubor jednoduše odstraníte z pracovního adresáře, zobrazí se ve výpisu `git status` v části „Changes not staged for commit“ (tedy „Změny nejsou připraveny k zapsání“):

source: If you specify `file://`, Git fires up the processes that it normally uses to transfer data over a network which is generally a lot less efficient method of transferring the data.
cs: Pokud zadáte výraz `file://`, Git spustí procesy, které běžně používá k přenosu dat po síti, což je obecně mnohem méně efektivní metoda přenosu dat.

source: If you specify a directory or file name, you can limit the log output to commits that introduced a change to those files.
cs: Jestliže zadáte název adresáře nebo souboru, výstup logu omezíte na revize, které provedly změnu v těchto souborech.

source: If you stage one part of the file and leave another part unstaged, your status output will look like this:
cs: Připravíte-li k zapsání jednu část souboru a druhou nikoli, bude výstup příkazu status vypadat asi takto:

source: If you stash some work, leave it there for a while, and continue on the branch from which you stashed the work, you may have a problem reapplying the work.
cs: Jestliže odložíte část své práce, necháte ji určitou dobu v zásobníku a budete pokračovat ve větvi, z níž jste práci odložili, můžete mít problémy s opětovnou aplikací odkladu.

source: If you switch to an older branch, your working directory will be reverted to look like it did the last time you committed on that branch.
cs: Pokud se přepnete na starší větev, váš pracovní adresář bude změněn do podoby z doby, kdy jste v oné větvi zapsali poslední revizi.

source: If you tell the script that it was, it stages the file to mark it as resolved for you.
cs: Pokud skriptu oznámíte, že ano, připraví soubor k zapsání a tím ho označí jako vyřešený.

source: If you track down a bug in your code and want to know when it was introduced and why, file annotation is often your best tool.
cs: Zjistíte-li ve svém zdrojovém kódu chybu a chcete vědět, kdy a jak vznikla, je často nejlepším nástrojem anotace souboru (file annotation).

source: If you treat rebasing as a way to clean up and work with commits before you push them, and if you only rebase commits that have never been available publicly, then you'll be fine.
cs: Pokud přeskládání chápete jako způsob úklidu a práce s revizemi před tím, než je odešlete, a pokud přeskládáváte jen revize, které nikdy nebyly veřejně dostupné, pak budete v pohodě.

source: If you try to check out that object again at some point, you’ll always get the data of the first object.
cs: Pokud se někdy v budoucnosti pokusíte znovu provést checkout tohoto objektu, vždy dostanete data prvního objektu.

source: If you try to merge two branches and subsequently have merge conflicts, you can run the command `git mergetool`; it starts P4Merge to let you resolve the conflicts through that GUI tool.
cs: Jestliže se pokusíte sloučit dvě větve a dojde při tom ke konfliktu, můžete spustit příkaz `git mergetool`. Příkaz spustí program P4Merge, v němž budete moci v grafickém uživatelském rozhraní konflikt vyřešit.

source: If you type `2` or `u` at the `What now>` prompt, the script prompts you for which files you want to stage:
cs: Zadáte-li na výzvu `What now>` (Co teď) odpověď `2` nebo `u`, skript se vás zeptá, které soubory chcete připravit k zapsání:

source: If you use the ACL structure returned from the `get_acl_access_data` method and check it against the listed files in each of the commits, you can determine whether the user has access to push all of their commits:
cs: Jestliže používáte strukturu ACL získanou metodou `get_acl_access_data` a kontrolujete ji proti seznamu souborů v každé revizi, můžete určit, zda bude mít uživatel oprávnění odesílat všechny své revize:

source: If you want Git instead to pull down only the `master` branch each time, and not every other branch on the remote server, you can change the fetch line to
cs: Pokud ale raději chcete, aby Git pokaždé stáhl pouze větev `master` a nestahoval žádné jiné větve na vzdáleném serveru, změňte řádek příkazu fetch na:

source: If you want Git to check object consistency on every push, you can force it to do so by setting `receive.fsckObjects` to true:
cs: Pokud chcete, aby Git kontroloval konzistenci objektů při každém odeslání dat, můžete mu to zadat nastavením možnosti `receive.fsckObjects` na hodnotu true:

source: If you want Git to try a bit more intelligently to resolve the conflict, you can pass a `-3` option to it, which makes Git attempt a three-way merge.
cs: Pokud chcete, aby se Git pokusil vyřešit konflikt inteligentněji, můžete zadat parametr `-3`. Git se pokusí o třícestné sloučení.

source: If you want a more up to date version, you can also install it via a binary installer.
cs: Pokud chcete aktuálnější verzi, můžete ji nainstalovat pomocí binárního instalátoru.

source: If you want an `opera` branch that you can work on separately, you can run
cs: Chcete-li používat větev `opera`, v níž můžete pracovat odděleně, spusťte příkaz:

source: If you want an easier way to test the stashed changes again, you can run `git stash branch`, which creates a new branch for you, checks out the commit you were on when you stashed your work, reapplies your work there, and then drops the stash if it applies successfully:
cs: Pokud byste uvítali jednodušší způsob, jak znovu otestovat odložené změny, můžete spustit příkaz `git stash branch`, který vytvoří novou větev, stáhne do ní revizi, na níž jste se nacházeli při odložení práce, a aplikuje na ni vaši práci. Proběhne-li aplikace úspěšně, Git odklad odstraní:

source: If you want more complex access control type permissions on your repositories, you can handle them with the normal filesystem permissions of the operating system your server runs.
cs: Pokud chcete pro své repozitáře nastavit komplexnější správu oprávnění, můžete je opatřit běžnými oprávněními k systému souborů, které vám nabízí operační systém daného serveru.

source: If you want the history, you can accomplish that as quickly as you can pull the data out of the Subversion server (which may take a while).
cs: Server Subversion můžete úplně přestat používat. Chcete-li získat historii projektu, dostanete ji tak rychle, jak jen dovedete stáhnout data ze serveru Subversion (což ovšem může chvíli trvat).

source: If you want to apply one of the older stashes, you can specify it by naming it, like this: `git stash apply stash@{2}`.
cs: Chcete-li aplikovat některý ze starších odkladů, můžete ho určit na základě jeho označení, např. `git stash apply stash@{2}`.

source: If you want to back up or clone your repository, copying this single directory elsewhere gives you nearly everything you need.
cs: Chcete-li zazálohovat nebo naklonovat repozitář, zkopírování tohoto jediného adresáře do jiného umístění vám poskytne prakticky vše, co budete potřebovat.

source: If you want to be more specific about which commands are colored and how, Git provides verb-specific coloring settings.
cs: Pokud byste rádi nastavili přesněji jak budou zvýrazněny různé příkazy nebo máte starší verzi, nabízí Git nastavení barev pro jednotlivé příkazy.

source: If you want to check out what GitWeb would look like for your project, Git comes with a command to fire up a temporary instance if you have a lightweight server on your system like `lighttpd` or `webrick`.
cs: Pokud vás zajímá, jak by GitWeb vypadal pro váš projekt, nabízí Git příkaz, jímž lze spustit dočasnou instanci. V systému je třeba mít lehký server typu `lighttpd` nebo `webrick`.

source: If you want to check your settings, you can use the `git config --list` command to list all the settings Git can find at that point:
cs: Chcete-li zkontrolovat vaše nastavení, použijte příkaz `git config --list`. Git vypíše všechna aktuálně dostupná nastavení:

source: If you want to clone the repository into a directory named something other than ``libgit2'', you can specify that as the next command-line option:
cs: Pokud chcete naklonovat repozitář do adresáře pojmenovaného jinak než `libgit2`, můžete název zadat jako další parametr na příkazovém řádku:

source: If you want to delete your `serverfix` branch from the server, you run the following:
cs: Chcete-li ze serveru odstranit větev `serverfix`, můžete provést následující:

source: If you want to do something one time, you can specify the refspec on the command line, too.
cs: Chcete-li nějakou akci provést pouze jednou, můžete použít refspec také na příkazovém řádku.

source: If you want to get a copy of an existing Git repository – for example, a project you'd like to contribute to – the command you need is `git clone`.
cs: Chcete-li vytvořit kopii existujícího gitového repozitáře (například u projektu, do nějž chcete začít přispívat), pak příkazem, který hledáte, je `git clone`.

source: If you want to make the `trunk` subdirectory be the new project root for every commit, `filter-branch` can help you do that, too:
cs: Chcete-li udělat z podadresáře `trunk` nový kořenový adresář projektu pro všechny revize, i s tím vám pomůže příkaz `filter-branch`:

source: If you want to map this to better Git author data, you need a mapping from the Subversion users to the Git authors.
cs: Jestliže vyžadujete podrobnější informace ve stylu systému Git, budete potřebovat mapování z uživatelů Subversion na autory Git.

source: If you want to override this with a different name or email address for specific projects, you can run the command without the `--global` option when you're in that project.
cs: Pokud chcete pro konkrétní projekt uživatelské jméno nebo e-mailovou adresu změnit (přebít), můžete příkaz spustit bez volby `--global`. V takovém případě je nutné, abyste se nacházeli v adresáři daného projektu.

source: If you want to pull commit `e43a6` into your master branch, you can run
cs: Chcete-li do hlavní větve natáhnout revizi `e43a6`, můžete zadat následující příkaz:

source: If you want to push from your laptop when you're at home, you have to mount the remote disk, which can be difficult and slow compared to network-based access.
cs: Pokud budete chtít odeslat data z notebooku doma, budete muset připojit vzdálený disk, což může být ve srovnání s přístupem prostřednictvím sítě složité a pomalé.

source: If you want to push to both a Git server and a Subversion server, you have to push (`dcommit`) to the Subversion server first, because that action changes your commit data.
cs: Chcete-li revize odeslat jak na server Git, tak na server Subversion, odešlete je nejprve na server Subversion (`dcommit`), protože tím změníte data revizí.

source: If you want to put a version of your repository in your working directory that looks like a specific tag, you can create a new branch at a specific tag with `git checkout -b [branchname] [tagname]`:
cs: Pokud do pracovního adresáře chcete z repozitáře získat verzi s určitou značkou, můžete pro označkovaný snímek vytvořit novou větev příkazem `git checkout -b [jméno-větve] [jméno-značky]`:
